In [1]:
import pandas as pd
import numpy as np

## Series

In [4]:
s = pd.Series([23,45,67,89,80])

In [5]:
s

0    23
1    45
2    67
3    89
4    80
dtype: int64

In [6]:
s.dtype

dtype('int64')

In [7]:
s=pd.Series([23,67,89,78,78.9])

In [8]:
s

0    23.0
1    67.0
2    89.0
3    78.0
4    78.9
dtype: float64

In [9]:
s[1]=76

In [10]:
s

0    23.0
1    76.0
2    89.0
3    78.0
4    78.9
dtype: float64

In [11]:
s.size

5

In [12]:
s=pd.Series([23,56,78,90,34,76],index=range(100,106))
s

100    23
101    56
102    78
103    90
104    34
105    76
dtype: int64

In [13]:
s[101]

56

## Dataframes

In [15]:
roll=pd.Series([1,2,3,4,5])
name=pd.Series(['sia','ajay','natasha','ravindra','ria'])
marks=pd.Series([67,89,90,56,77])

In [16]:
name

0         sia
1        ajay
2     natasha
3    ravindra
4         ria
dtype: object

In [17]:
df = pd.DataFrame({
    'roll':roll,
    'name':name,
    'marks':marks
})
df

   roll      name  marks
0     1       sia     67
1     2      ajay     89
2     3   natasha     90
3     4  ravindra     56
4     5       ria     77

In [18]:
df.shape

(5, 3)

In [19]:
df.size

15

In [20]:
df.columns

Index(['roll', 'name', 'marks'], dtype='object')

In [21]:
## current working directory

In [22]:
import os
os.getcwd()

'C:\\Users\\user\\Desktop\\internship\\week 4'

In [23]:
"""
location => https://mitu.co.in/dataset
download all the files starting from student*csv
eg... student1.csv,student2.csv...

put them into same directory as your juypter notebook files 

"""

'\nlocation => https://mitu.co.in/dataset\ndownload all the files starting from student*csv\neg... student1.csv,student2.csv...\n\nput them into same directory as your juypter notebook files \n\n'

In [27]:
df = pd.read_csv("student.csv")

In [28]:
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [30]:
df1 = pd.read_csv("student1.csv")
df1

    1     anil  TE  56.77  22
0   2     amit  TE  59.77  21
1   3   aniket  BE  76.88  19
2   4  ajinkya  TE  69.66  20
3   5     asha  TE  63.28  20
4   6   ayesha  BE  49.55  20
5   7     amar  BE  65.34  19
6   8    amita  BE  68.33  23
7   9     amol  TE  56.75  20
8  10    anmol  BE  78.66  21

In [32]:
header=["A","B","C","D","E"]
df1=pd.read_csv("student1.csv",names=header)
df1

    A        B   C      D   E
0   1     anil  TE  56.77  22
1   2     amit  TE  59.77  21
2   3   aniket  BE  76.88  19
3   4  ajinkya  TE  69.66  20
4   5     asha  TE  63.28  20
5   6   ayesha  BE  49.55  20
6   7     amar  BE  65.34  19
7   8    amita  BE  68.33  23
8   9     amol  TE  56.75  20
9  10    anmol  BE  78.66  21

In [37]:
df2=pd.read_csv("student3.tsv" ,sep='\t')
df2

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [39]:
df3=pd.read_csv("https://drive.google.com/file/d/1WdfKqcoYD5OrO0EZtUG0YtmqyvW6Gp_O/view?usp=drive_link",sep='\t')
df3

    <!DOCTYPE html><html><head><script nonce="EiIZNNbiB8j3US-5er9fNg"> window['_DRIVE_VIEWER_ctiming']={}; </script><meta name="google" content="notranslate"><meta http-equiv="X-UA-Compatible" content="IE=edge;"><style nonce="C20ZSmuPrr8s_wD2rIcwVg">@font-face{font-family:'Roboto';font-style:italic;font-weight:400;src:url(//fonts.gstatic.com/s/roboto/v18/KFOkCnqEu92Fr1Mu51xIIzc.ttf)format('truetype');}@font-face{font-family:'Roboto';font-style:normal;font-weight:300;src:url(//fonts.gstatic.com/s/roboto/v18/KFOlCnqEu92Fr1MmSU5fBBc9.ttf)format('truetype');}@font-face{font-family:'Roboto';font-style:normal;font-weight:400;src:url(//fonts.gstatic.com/s/roboto/v18/KFOmCnqEu92Fr1Mu4mxP.ttf)format('truetype');}@font-face{font-family:'Roboto';font-style:normal;font-weight:500;src:url(//fonts.gstatic.com/s/roboto/v18/KFOlCnqEu92Fr1MmEU9fBBc9.ttf)format('truetype');}@font-face{font-family:'Roboto';font-style:normal;font-weight:700;src:url(//fonts.gstatic.com/s/roboto/v18/KFOlCnqEu92Fr1MmWUlfBBc9.ttf)format('truetype');}@font-face{font-family:'Google Sans';font-style:normal;font-weight:400;src:url(//fonts.gstatic.com/s/googlesans/v62/4Ua_rENHsxJlGDuGo1OIlJfC6l_24rlCK1Yo_Iqcsih3SAyH6cAwhWdRFD48TE63OOYKtrwEIJllpyw.ttf)format('truetype');}@font-face{font-family:'Google Sans';font-style:normal;font-weight:400;src:url(//fonts.gstatic.com/s/googlesans/v62/4Ua_rENHsxJlGDuGo1OIlJfC6l_24rlCK1Yo_Iqcsih3SAyH6cAwhX9RFD48TE63OOYKtrwEIJllpyw.ttf)format('truetype');}@font-face{font-family:'Google Sans';font-style:normal;font-weight:500;src:url(//fonts.gstatic.com/s/googlesans/v62/4Ua_rENHsxJlGDuGo1OIlJfC6l_24rlCK1Yo_Iqcsih3SAyH6cAwhWdRFD48TE63OOYKtrw2IJllpyw.ttf)format('truetype');}@font-face{font-family:'Google Sans';font-style:normal;font-weight:500;src:url(//fonts.gstatic.com/s/googlesans/v62/4Ua_rENHsxJlGDuGo1OIlJfC6l_24rlCK1Yo_Iqcsih3SAyH6cAwhX9RFD48TE63OOYKtrw2IJllpyw.ttf)format('truetype');}@font-face{font-family:'Google Sans';font-style:normal;font-weight:700;src:url(//fonts.gstatic.com/s/googlesans/v62/4Ua_rENHsxJlGDuGo1OIlJfC6l_24rlCK1Yo_Iqcsih3SAyH6cAwhX9RFD48TE63OOYKtrzjJ5llpyw.ttf)format('truetype');}</style><meta name="referrer" content="origin"><title>Synthetic-Infant-Health-Data.csv - Google Drive</title><script nonce="EiIZNNbiB8j3US-5er9fNg">
0              window['_DRIVE_VIEWER_IVIS'] = docum...
1            </script><meta property="og:title" con...
2                                                 try{
3    _._F_toggles_initialize=function(a){(typeof gl...
4                                                   /*
..                                                 ...
123  var xj=function(a,b,c){a<b?wj(a+1,b):_.Rd.log(...
124                     }catch(e){_._DumpException(e)}
125                                    })(this.gbar_);
126                                     // Google Inc.
127  </script><script nonce="EiIZNNbiB8j3US-5er9fNg...

[128 rows x 1 columns]

In [40]:
df = pd.read_csv("student.csv")
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [41]:
df.shape

(10, 5)

In [42]:
df.columns

Index(['roll', 'name', 'class', 'marks', 'age'], dtype='object')

In [43]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   roll    10 non-null     int64
 1   name    10 non-null     object
 2   class   10 non-null     object
 3   marks   10 non-null     float64
 4   age     10 non-null     int64
dtypes: float64(1), int64(2), object(2)
memory usage: 532.0+ bytes

In [45]:
df.T   ## INVERSE DATA IN ROWS TO COLUMNS OR COLUMNS TO ROWS

,0,1,2,3,4,5,6,7,8,9
roll,1,2,3,4,5,6,7,8,9,10
name,anil,amit,aniket,ajinkya,asha,ayesha,amar,amita,amol,anmol
class,TE,TE,BE,TE,TE,BE,BE,BE,TE,BE
marks,56.77,59.77,76.88,69.66,63.28,49.55,65.34,68.33,56.75,78.66
age,22,21,19,20,20,20,19,23,20,21

In [46]:
df.dtypes

roll       int64
name      object
class     object
marks    float64
age        int64
dtype: object

In [47]:
df.head()

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20

In [48]:
df.tail()

   roll    name class  marks  age
5     6  ayesha    BE  49.55   20
6     7    amar    BE  65.34   19
7     8   amita    BE  68.33   23
8     9    amol    TE  56.75   20
9    10   anmol    BE  78.66   21

In [49]:
df.head(3)

   roll    name class  marks  age
0     1    anil    TE  56.77   22
1     2    amit    TE  59.77   21
2     3  aniket    BE  76.88   19

In [50]:
df.describe()

           roll      marks        age
count  10.00000  10.000000  10.000000
mean    5.50000  64.499000  20.500000
std     3.02765   9.207179   1.269296
min     1.00000  49.550000  19.000000
25%     3.25000  57.520000  20.000000
50%     5.50000  64.310000  20.000000
75%     7.75000  69.327500  21.000000
max    10.00000  78.660000  23.000000

In [51]:
df.max()

roll         10
name     ayesha
class        TE
marks     78.66
age          23
dtype: object

In [52]:
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [55]:
df.iloc[2:5,0:3]

   roll     name class
2     3   aniket    BE
3     4  ajinkya    TE
4     5     asha    TE

In [54]:
x = df.iloc[2:5,0:3]
x

   roll     name class
2     3   aniket    BE
3     4  ajinkya    TE
4     5     asha    TE

In [67]:
df.iloc[[5,6,8],0:3]

   roll    name class
5     6  ayesha    BE
6     7    amar    BE
8     9    amol    TE

In [74]:
df.loc[:,'name']

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [75]:
df.loc[:,['name','class']]

      name class
0     anil    TE
1     amit    TE
2   aniket    BE
3  ajinkya    TE
4     asha    TE
5   ayesha    BE
6     amar    BE
7    amita    BE
8     amol    TE
9    anmol    BE

In [76]:
df.drop(9)

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20

In [77]:
df.drop('roll',axis=1)

      name class  marks  age
0     anil    TE  56.77   22
1     amit    TE  59.77   21
2   aniket    BE  76.88   19
3  ajinkya    TE  69.66   20
4     asha    TE  63.28   20
5   ayesha    BE  49.55   20
6     amar    BE  65.34   19
7    amita    BE  68.33   23
8     amol    TE  56.75   20
9    anmol    BE  78.66   21

In [78]:
col = {'roll':'id'}

In [79]:
df.rename(columns=col)

   id     name class  marks  age
0   1     anil    TE  56.77   22
1   2     amit    TE  59.77   21
2   3   aniket    BE  76.88   19
3   4  ajinkya    TE  69.66   20
4   5     asha    TE  63.28   20
5   6   ayesha    BE  49.55   20
6   7     amar    BE  65.34   19
7   8    amita    BE  68.33   23
8   9     amol    TE  56.75   20
9  10    anmol    BE  78.66   21

In [85]:
ind1= {1:'one',3:'three'}
df.rename(index=ind1)

       roll     name class  marks  age
0         1     anil    TE  56.77   22
one       2     amit    TE  59.77   21
2         3   aniket    BE  76.88   19
three     4  ajinkya    TE  69.66   20
4         5     asha    TE  63.28   20
5         6   ayesha    BE  49.55   20
6         7     amar    BE  65.34   19
7         8    amita    BE  68.33   23
8         9     amol    TE  56.75   20
9        10    anmol    BE  78.66   21

In [87]:
df['roll']=df['roll']+100

In [88]:
df

   roll     name class  marks  age
0   101     anil    TE  56.77   22
1   102     amit    TE  59.77   21
2   103   aniket    BE  76.88   19
3   104  ajinkya    TE  69.66   20
4   105     asha    TE  63.28   20
5   106   ayesha    BE  49.55   20
6   107     amar    BE  65.34   19
7   108    amita    BE  68.33   23
8   109     amol    TE  56.75   20
9   110    anmol    BE  78.66   21

In [89]:
df['roll']=100

In [90]:
df

   roll     name class  marks  age
0   100     anil    TE  56.77   22
1   100     amit    TE  59.77   21
2   100   aniket    BE  76.88   19
3   100  ajinkya    TE  69.66   20
4   100     asha    TE  63.28   20
5   100   ayesha    BE  49.55   20
6   100     amar    BE  65.34   19
7   100    amita    BE  68.33   23
8   100     amol    TE  56.75   20
9   100    anmol    BE  78.66   21

## problem

In [91]:
#1.create a series using a list of 5 fruits name.assign custom index lable to each element

In [97]:
s = pd.Series(['Apple','PAPAYA','MANGO','PEAR','BANANAS'])
s
ind1= {0:'zero',1:'one',2:'two',3:'three',4:'four'}
s.rename(index=ind1)

zero       Apple
one       PAPAYA
two        MANGO
three       PEAR
four     BANANAS
dtype: object

In [98]:
# 2. create dataframe from foll dic:

In [102]:
Name=pd.Series(['Alice','Bob','Charlie'])
Age=pd.Series([25,30,35])
City=pd.Series(['Pune','mumbai','nagpur'])
df = pd.DataFrame({
    'Name':Name,
     'Age':Age,
    'City':City
})
df

      Name  Age    City
0    Alice   25    Pune
1      Bob   30  mumbai
2  Charlie   35  nagpur

In [103]:
# 3. create a dataframe using  numpy to generate a 3x3 matrix of random integer between 1 and 100 .assign col names as 'A','B','C'

In [105]:
import pandas as pd
import numpy as np
random_array = np.random.randint(1, 101, size=20)
random_array

array([100,  60,   8,  21,  12,   4,  55,  76,  20,  35,  38,  65,  65,
        49,  88,  47,  91,  63,   6,   7])

In [1]:
# 4. Using the DataFrame from Question 2, display: - First 2 rows - Last row - Shape of the DataFrame

In [2]:
import pandas as pd

data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['Pune', 'Mumbai', 'Nagpur']
}

df = pd.DataFrame(data)

print("First 2 rows:\n", df.head(2))

print("\nLast row:\n", df.tail(1))

print("\nShape of DataFrame:", df.shape)

First 2 rows:
     Name  Age    City
0  Alice   25    Pune
1    Bob   30  Mumbai

Last row:
       Name  Age    City
2  Charlie   35  Nagpur

Shape of DataFrame: (3, 3)

In [3]:
# 5. Use .info() and .describe() on the DataFrame created in Question 2

In [4]:
import pandas as pd

data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['Pune', 'Mumbai', 'Nagpur']
}

df = pd.DataFrame(data)

print("DataFrame Info:\n")
df.info()

print("\nDataFrame Description:\n")
print(df.describe())

DataFrame Info:

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   City    3 non-null      object
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes

DataFrame Description:

        Age
count   3.0
mean   30.0
std     5.0
min    25.0
25%    27.5
50%    30.0
75%    32.5
max    35.0

In [5]:
# 6. From the DataFrame in Question 2, select only the 'Name' and 'City' columns using loc .

In [6]:
import pandas as pd

data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['Pune', 'Mumbai', 'Nagpur']
}

df = pd.DataFrame(data)

selected_columns = df.loc[:, ['Name', 'City']]

print(selected_columns)

      Name    City
0    Alice    Pune
1      Bob  Mumbai
2  Charlie  Nagpur

In [7]:
# 7. From the DataFrame in Question 2, use iloc to display the second row

In [8]:
import pandas as pd

data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['Pune', 'Mumbai', 'Nagpur']
}

df = pd.DataFrame(data)

second_row = df.iloc[1]

print("Second row:\n", second_row)

Second row:
 Name       Bob
Age         30
City    Mumbai
Name: 1, dtype: object

In [9]:
# 8. Rename the 'Age' column to 'Years' in the DataFrame from Question 2.

In [10]:
import pandas as pd

data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['Pune', 'Mumbai', 'Nagpur']
}

df = pd.DataFrame(data)

df.rename(columns={'Age': 'Years'}, inplace=True)

print(df)

      Name  Years    City
0    Alice     25    Pune
1      Bob     30  Mumbai
2  Charlie     35  Nagpur

In [11]:
# 9. Drop the 'City' column from the DataFrame in Question 2

In [12]:
df.drop(columns='City', inplace=True)

print(df)

      Name  Years
0    Alice     25
1      Bob     30
2  Charlie     35

In [13]:
# 10. Modify the 'Years' column (previously 'Age') by adding 5 to each value.

In [14]:

df['Years'] = df['Years'] + 5

print(df)

      Name  Years
0    Alice     30
1      Bob     35
2  Charlie     40